etc/load.test.result
pd wrk Ⴥ ./wrk -c400 -d120s -t8 --latency 'http://localhost:8090/lua/test.lua?a=1&b=lol#wtf'
Running 2m test @ http://localhost:8090/lua/test.lua?a=1&b=lol#wtf
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    77.37ms  228.05ms   2.00s    91.19%
    Req/Sec     7.74k   840.03    16.59k    76.77%
  Latency Distribution
     50%    5.47ms
     75%   10.03ms
     90%  240.30ms
     99%    1.18s
  7393760 requests in 2.00m, 1.32GB read
  Socket errors: connect 0, read 0, write 0, timeout 551
  Non-2xx or 3xx responses: 42
Requests/sec:  61572.92
Transfer/sec:     11.27MB



root / # lscpu
Architecture:          x86_64
CPU op-mode(s):        32-bit, 64-bit
Byte Order:            Little Endian
CPU(s):                4
On-line CPU(s) list:   0-3
Thread(s) per core:    1
Core(s) per socket:    4
Socket(s):             1
NUMA node(s):          1
Vendor ID:             GenuineIntel
CPU family:            6
Model:                 42
Model name:            Intel(R) Core(TM) i5-2310 CPU @ 2.90GHz
Stepping:              7
CPU MHz:               1799.246
CPU max MHz:           3200.0000
CPU min MHz:           1600.0000
BogoMIPS:              5788.65
Virtualization:        VT-x
L1d cache:             32K
L1i cache:             32K
L2 cache:              256K
L3 cache:              6144K
NUMA node0 CPU(s):     0-3
Flags:                 fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx rdtscp lm constant_tsc arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc aperfmperf eagerfpu pni pclmulqdq dtes64 monitor ds_cpl vmx est tm2 ssse3 cx16 xtpr pdcm pcid sse4_1 sse4_2 popcnt tsc_deadline_timer aes xsave avx lahf_lm ida arat epb pln pts dtherm tpr_shadow vnmi flexpriority ept vpid xsaveopt