etc/load.test.result
pd wrk Ⴥ ./wrk -c400 -d120s -t8 --latency 'http://localhost:8090/lua/test.lua?a=1&b=lol#wtf'
Running 2m test @ http://localhost:8090/lua/test.lua?a=1&b=lol#wtf
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    77.37ms  228.05ms   2.00s    91.19%
    Req/Sec     7.74k   840.03    16.59k    76.77%
  Latency Distribution
     50%    5.47ms
     75%   10.03ms
     90%  240.30ms
     99%    1.18s
  7393760 requests in 2.00m, 1.32GB read
  Socket errors: connect 0, read 0, write 0, timeout 551
  Non-2xx or 3xx responses: 42
Requests/sec:  61572.92
Transfer/sec:     11.27MB